000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ШаблоныЧеков/ШаблоныЧеков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныЧеков</name>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШаблона</name>
    <type>
      <types>EnumRef.ТипыШаблоновЧеков</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтрокиПодвала</name>
    <attributes>
      <name>QRкод</name>
      <comment>Печатать QR код</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Строка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыШаблоновЧеков/ТипыШаблоновЧеков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШаблоновЧеков</name>
  <enumValues>
    <name>ЧекККМ</name>
  </enumValues>
  <enumValues>
    <name>Купоннинг</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ШаблоныЧеков/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И Объект.ТипШаблона = ПредопределенноеЗначение("Перечисление.ТипыШаблоновЧеков.ЧекККМ") Тогда
		Отказ = ПередЗаписьюПроверить(Объект.Магазин);
		Если Отказ Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Шаблон для магазина "+ Объект.Магазин + " уже существует, следует редактировать его. Один магазин - один элемент.";
			Сообщение.Сообщить(); 
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПередЗаписьюПроверить(Магазин)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ШаблоныЧеков.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШаблоныЧеков КАК ШаблоныЧеков
	|ГДЕ
	|	ШаблоныЧеков.Магазин = &Магазин
	|	И ШаблоныЧеков.ТипШаблона = ЗНАЧЕНИЕ(Перечисление.ТипыШаблоновЧеков.ЧекККМ)"
	);
	
	Запрос.УстановитьПараметр("Магазин", Магазин);
	Запрос.УстановитьПараметр("ТипШаблона", Перечисления.ТипыШаблоновЧеков.ЧекККМ);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Процедура ВставитьТелефонДиректора(Команда)

	ВставитьМнемоимя("#DIRPHONE#");

КонецПроцедуры

&НаКлиенте
Процедура ВставитьСерийныйНомер(Команда)

	ВставитьМнемоимя("#SERIALNUM#");

КонецПроцедуры

&НаКлиенте
Процедура ВставитьМнемоимя(Мнемоимя)

	Если НЕ Элементы.СтрокиПодвала.ТекущаяСтрока = Неопределено Тогда

		ТекущиеДанные = Объект.СтрокиПодвала.НайтиПоИдентификатору(Элементы.СтрокиПодвала.ТекущаяСтрока);
		ТекущиеДанные.Строка = СокрЛП(СокрЛП(ТекущиеДанные.Строка) + " " + Мнемоимя);

	КонецЕсли;

КонецПроцедуры
